In [1]:
import pandas as pd

In [3]:
directory = "./Resources/budget_data.csv"
data = pd.read_csv(directory)

In [4]:
data

        Date  Profit/Losses
0   Jan-2010         867884
1   Feb-2010         984655
2   Mar-2010         322013
3   Apr-2010         -69417
4   May-2010         310503
..       ...            ...
81  Oct-2016         102685
82  Nov-2016         795914
83  Dec-2016          60988
84  Jan-2017         138230
85  Feb-2017         671099

[86 rows x 2 columns]

# Task 1
The total number of months included in the dataset.

In [11]:
data

        Date  Profit/Losses
0   Jan-2010         867884
1   Feb-2010         984655
2   Mar-2010         322013
3   Apr-2010         -69417
4   May-2010         310503
..       ...            ...
81  Oct-2016         102685
82  Nov-2016         795914
83  Dec-2016          60988
84  Jan-2017         138230
85  Feb-2017         671099

[86 rows x 2 columns]

In [6]:
data["Date"]

0     Jan-2010
1     Feb-2010
2     Mar-2010
3     Apr-2010
4     May-2010
        ...
81    Oct-2016
82    Nov-2016
83    Dec-2016
84    Jan-2017
85    Feb-2017
Name: Date, Length: 86, dtype: object

In [7]:
len(data["Date"])

86

In [8]:
Total_Months = len(data["Date"])

In [9]:
Total_Months

86

# Task 2
The net total amount of Profit/Losses over the entire period.

In [10]:
data

        Date  Profit/Losses
0   Jan-2010         867884
1   Feb-2010         984655
2   Mar-2010         322013
3   Apr-2010         -69417
4   May-2010         310503
..       ...            ...
81  Oct-2016         102685
82  Nov-2016         795914
83  Dec-2016          60988
84  Jan-2017         138230
85  Feb-2017         671099

[86 rows x 2 columns]

In [12]:
sum(data["Profit/Losses"])

38382578

In [13]:
Net_Total = sum(data["Profit/Losses"])

In [14]:
Net_Total

38382578

# Task 3
The net total amount of Profit/Losses over the entire period.

In [15]:
data

        Date  Profit/Losses
0   Jan-2010         867884
1   Feb-2010         984655
2   Mar-2010         322013
3   Apr-2010         -69417
4   May-2010         310503
..       ...            ...
81  Oct-2016         102685
82  Nov-2016         795914
83  Dec-2016          60988
84  Jan-2017         138230
85  Feb-2017         671099

[86 rows x 2 columns]

In [22]:
change = [0]
for t in range(len(data["Profit/Losses"])-1):
    change.append(int(data["Profit/Losses"][t+1])-int(data["Profit/Losses"][t]))

In [23]:
len(change)-1

85

In [24]:
data["Change"] = change

In [25]:
data

        Date  Profit/Losses  Change
0   Jan-2010         867884       0
1   Feb-2010         984655  116771
2   Mar-2010         322013 -662642
3   Apr-2010         -69417 -391430
4   May-2010         310503  379920
..       ...            ...     ...
81  Oct-2016         102685 -665765
82  Nov-2016         795914  693229
83  Dec-2016          60988 -734926
84  Jan-2017         138230   77242
85  Feb-2017         671099  532869

[86 rows x 3 columns]

In [26]:
Average_Change = sum(change)/(len(change)-1)

In [27]:
Average_Change

-2315.1176470588234

In [28]:
print(round(Average_Change, 2))

-2315.12

# Task 4
The greatest increase in profits (date and amount) over the entire period.

In [29]:
max(change)

1926159

In [31]:
data[data["Change"]==max(change)]

        Date  Profit/Losses   Change
25  Feb-2012        1170593  1926159

In [32]:
Max_Inc=data[data["Change"]==max(change)]

In [33]:
Max_Inc

        Date  Profit/Losses   Change
25  Feb-2012        1170593  1926159

In [34]:
Max_Inc.iloc[0,0]

'Feb-2012'

In [35]:
Max_Inc.iloc[0,2]

1926159

# Task 5
The greatest decrease in losses (date and amount) over the entire period.

In [36]:
min(change)

-2196167

In [37]:
data[data["Change"]==min(change)]

        Date  Profit/Losses   Change
44  Sep-2013       -1196225 -2196167

In [38]:
Max_Dec=data[data["Change"]==min(change)]

In [39]:
Max_Dec

        Date  Profit/Losses   Change
44  Sep-2013       -1196225 -2196167

In [40]:
Max_Dec.iloc[0,0]

'Sep-2013'

In [41]:
Max_Dec.iloc[0,2]

-2196167

# Final Analysis

In [47]:
print("Financial Analysis")
print("----------------------------")
print("Total Months: %d" % (Total_Months))
print("Total: $%d" % (Net_Total))
print("Average Change: $%.2f" % (Average_Change))
print("Greatest Increase in Profits: %s ($%d)" % (Max_Inc.iloc[0,0],Max_Inc.iloc[0,2]))
print("Greatest Decrease in Profits: %s ($%d)" % (Max_Dec.iloc[0,0],Max_Dec.iloc[0,2]))

Financial Analysis
----------------------------
Total Months: 86
Total: $38382578
Average Change: $-2315.12
Greatest Increase in Profits: Feb-2012 ($1926159)
Greatest Decrease in Profits: Sep-2013 ($-2196167)